[{"data":1,"prerenderedAt":50},["ShallowReactive",2],{"content-/projects/other":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"cover":9,"order":11,"body":12,"_type":44,"_id":45,"_source":46,"_file":47,"_stem":48,"_extension":49},"/projects/other","projects",false,"","Other things",null,"2024-12-25",6,{"type":13,"children":14,"toc":41},"root",[15,23,28],{"type":16,"tag":17,"props":18,"children":19},"element","p",{},[20],{"type":21,"value":22},"text","The \"personal project\" I started months ago hasn't had much love in a while.\nIt was started when I was still working with simple JavaScript and HTML pages, but once we started learning TypeScript and React, I found that a lot of my previous work was obsolete!\nMy intention is to be able to upload, parse, and analyse electricity usage data (csv files), initially just from Electric Kiwi, and compare the usage costs accross a range of Electricity pricing plans.\nNow that I have a better understanding of how to structure and write code, and have a bit more time on my hands, I ought to be able to make more progress on this.",{"type":16,"tag":17,"props":24,"children":25},{},[26],{"type":21,"value":27},"Comprehensive weather alerts.",{"type":16,"tag":17,"props":29,"children":30},{},[31,33,39],{"type":21,"value":32},"A good friend of mine, Shub, and I plan to build an old idea of mine.\nOne of the problems that we're intending to solve is that when you want to do an outdoor activity, you often have to consult multiple sources in order to figure out if it's going to be suitable. Surfing, Paragliding, Kitesurfing, Rock climbing, Mountain Biking, Skiing, Garden watering, Stargazing, Aurora Watching...\nPerhaps we can monetise it... Perhaps we ",{"type":16,"tag":34,"props":35,"children":36},"em",{},[37],{"type":21,"value":38},"have to",{"type":21,"value":40}," monetise it to cover the costs of all the API calls! Things to discover...",{"title":7,"searchDepth":42,"depth":42,"links":43},2,[],"markdown","content:projects:other.md","content","projects/other.md","projects/other","md",1735290571489]